In [2]:
dict = {"country": ["Brazil", "Russia", "India", "China", "South Africa"],
       "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"],
       "area": [8.516, 17.10, 3.286, 9.597, 1.221],
       "population": [200.4, 143.5, 1252, 1357, 52.98] }

import pandas as pd
brics = pd.DataFrame(dict)
print(brics)

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [3]:
# set index for brics
brics.index = ["BR", "RU", "IN", "CH", "SA"]
brics

         country    capital    area  population
BR        Brazil   Brasilia   8.516      200.40
RU        Russia     Moscow  17.100      143.50
IN         India  New Dehli   3.286     1252.00
CH         China    Beijing   9.597     1357.00
SA  South Africa   Pretoria   1.221       52.98

In [10]:
# importing a existing CSV file and read file
cars = pd.read_csv('data/cars.csv')
cars.head(5)

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True

# Indexing DataFrames

In [11]:
cars = pd.read_csv('data/cars.csv', index_col=0)
print(cars['cars_per_cap'])

US     809
AUS    731
JAP    588
IN      18
RU     200
MOR     70
EG      45
Name: cars_per_cap, dtype: int64

In [12]:
cars[['cars_per_cap']]

     cars_per_cap
US            809
AUS           731
JAP           588
IN             18
RU            200
MOR            70
EG             45

In [13]:
cars[['cars_per_cap', 'country']]

     cars_per_cap        country
US            809  United States
AUS           731      Australia
JAP           588          Japan
IN             18          India
RU            200         Russia
MOR            70        Morocco
EG             45          Egypt

In [14]:
cars[0:4]

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False

In [15]:
cars[4:6]

     cars_per_cap  country  drives_right
RU            200   Russia          True
MOR            70  Morocco          True

**loc** and **iloc** to perform just about data selection operation.

**loc** : 
1) label based
2) which means that you have to specify rows and columns based on their row and column labels.

**iloc** :
1) integer index based
2) specify rows and columns by their integer index

In [18]:
cars.iloc[2]

cars_per_cap      588
country         Japan
drives_right    False
Name: JAP, dtype: object

In [19]:
cars.iloc[0]

cars_per_cap              809
country         United States
drives_right             True
Name: US, dtype: object

In [20]:
cars.iloc[3]

cars_per_cap       18
country         India
drives_right    False
Name: IN, dtype: object

In [23]:
cars.loc[['AUS', 'EG']]

     cars_per_cap    country  drives_right
AUS           731  Australia         False
EG             45      Egypt          True